<?php

namespace PospalHelper\Core\Exception;

use Throwable;

class PospalException extends \Exception
{
    private const ErrorMessage = [
        0 => '未知错误',

        1001 => '收银员不存在',
        1002 => '收银员工号与密码不匹配',

        1011 => '用户名或密码错误',
        1012 => '请输入用户名、密码',
        1013 => '该用户不存在',
        1014 => '该账号已存在',
        1015 => '账号不能为空',
        1016 => '账号长度不得小于6位',
        1017 => '账号长度不得大于32位',
        1018 => '账号包含无效字符，应为数字、字母、下划线、或@组成',

        1021 => '密码不正确',
        1022 => '密码不能为空',
        1023 => '密码长度不得小于6位',
        1024 => '密码长度不得大于32位',
        1025 => '密码包含无效字符',

        1031 => '请求头中没传消息签名',
        1032 => '消息体与消息签名不匹配',
        1033 => '校验消息签名时出错',
        1034 => 'appId错误，根据所传的appId找不到对应的用户',

        1091 => '邮箱不能为空',
        1092 => '邮箱格式不正确',
        1093 => '该邮箱已存在',
        1094 => '联系电话不能为空',
        1095 => '公司名称不能为空',
        1096 => '联系地址不能为空',
        1097 => '联系地址格式不正确',
        1098 => '注册用户失败',

        2001 => '次卡剩余次数不足',
        2002 => '次卡不存在',
        2011 => '添加会员信息失败',
        2012 => '会员已存，不允许重复添加',
        2013 => '修改会员信息失败',
        2015 => '会员不存在',
        2016 => '没有权限修改会员',

        3001 => '优惠券无效',
        3002 => '优惠券已停用',
        3003 => '优惠券号不足',
        3004 => '优惠券号已经存在',

        4001 => '您尚未开通我的店铺，可前往官网（pospal.cn）开通使用',
        4002 => '我的店铺已过期，可前往官网（pospal.cn）续费使用',

        9001 => '只能在规则时间内使用',
        9002 => '抱歉，您当前使用的收银软件版本太低，请下载安装最新版本，再登录您的账号继续使用',

        9003 => '请求参数错误',
        9004 => '您所使用的版本太旧，请更升级到最新版本',
    ];

    public function getErrMsg(): string
    {
        return self::ErrorMessage[(int)$this->code] ?? 'Unknown Error';
    }
}